################################################
# Опрделение порядкового номера введенной даты #
################################################

loop do
  puts "Введите произвольную дату в формате 00.00.2019:"
  date = gets.chomp.split(".")
  date = date.map{ |e| e.to_i}

  if date[0] < 1 || date[0] > 31
    puts "Неправильная дата"
  elsif date[1] < 1 || date[1] > 12
    puts "Неправильный месяц"
  elsif date[2] != 2019
    puts "Неправильный год"
  else
    break
    print date
  end
  
end
